src/Documents/кпкПланПосещений/кпкПланПосещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>кпкПланПосещений</name>
  <registerRecords>AccumulationRegister.кпкПланыПродаж</registerRecords>
  <attributes>
    <name>Агент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалПланирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПланированияПродаж</name>
    <type>
      <types>CatalogRef.кпкТипыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.кпкВидыОперацийПланирования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Дни</name>
    <attributes>
      <name>ТорговаяТочка</name>
      <type>
        <types>CatalogRef.кпкТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>Д1</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д2</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д3</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д4</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д5</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д6</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д7</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д8</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д9</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д10</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д11</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д12</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д13</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д14</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д15</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д16</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д17</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д18</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д19</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д20</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д21</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д22</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д23</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д24</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д25</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д26</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д27</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д28</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д29</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д30</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Д31</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоПосещений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланПродаж</name>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/кпкПланыПродаж/кпкПланыПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>кпкПланыПродаж</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Агент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПланирования</name>
    <type>
      <types>DocumentRef.кпкПланПосещений</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/кпкВидыОперацийПланирования/кпкВидыОперацийПланирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кпкВидыОперацийПланирования</name>
  <enumValues>
    <name>ПланированиеПосещений</name>
  </enumValues>
  <enumValues>
    <name>ПланированиеПродаж</name>
  </enumValues>
  <enumValues>
    <name>ПланПосещенийИПродажи</name>
  </enumValues>
</mdclass:Enum>

src/Documents/кпкЗаданиеАгента/кпкЗаданиеАгента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>кпкЗаданиеАгента</name>
  <basedOn>Document.кпкМаршрут</basedOn>
  <basedOn>Document.кпкПланПосещений</basedOn>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>кпкТорговаяТочка</name>
    <type>
      <types>CatalogRef.кпкТорговыеТочки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.кпкПланПосещений</types>
      <types>DocumentRef.кпкМаршрут</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Агент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.кпкКатегорииДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновитьВКПК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьЗаданий</name>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>CatalogRef.кпкВидыЗаданий</types>
      </type>
    </attributes>
    <attributes>
      <name>Задание</name>
      <type>
        <types>CatalogRef.кпкВидыЗаданий</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Обязательная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>DocumentRef.ОтчетОРозничныхПродажах</types>
        <types>DocumentRef.ИнвентаризацияТоваровНаСкладе</types>
        <types>Boolean</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.кпкПосещение</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
        <types>DocumentRef.кпкМерчендайзинг</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>String</types>
        <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
        <types>DocumentRef.ПеремещениеТоваров</types>
        <types>Date</types>
        <types>Number</types>
        <types>CatalogRef.кпкФотоКДокументам</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/кпкМаршрут/кпкМаршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>кпкМаршрут</name>
  <basedOn>Document.кпкПланПосещений</basedOn>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.кпкПланПосещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Агент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПлана</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокПосещений</name>
    <attributes>
      <name>ТорговаяТочка</name>
      <type>
        <types>CatalogRef.кпкТорговыеТочки</types>
      </type>
    </attributes>
    <attributes>
      <name>Внеплана</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Напоминание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/кпкПланПосещений/ObjectModule.bsl
//Переменные модуля

Перем ТаблицаЗаданий Экспорт; // Таблица значений, в которую записываются задания агента

// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

// Процедура формирует таблицу с заданиями
//
Процедура ОбновитьТаблицуЗаданий() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(кпкЗаданиеАгента.Дата, ДЕНЬ) КАК День,
	|	кпкЗаданиеАгента.Ссылка КАК Документ,
	|	кпкЗаданиеАгента.Контрагент,
	|	кпкЗаданиеАгента.кпкТорговаяТочка КАК ТорговаяТочка
	|ИЗ
	|	Документ.кпкЗаданиеАгента КАК кпкЗаданиеАгента
	|ГДЕ
	|	кпкЗаданиеАгента.Агент = &Агент
	|	И кпкЗаданиеАгента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И кпкЗаданиеАгента.ПометкаУдаления = ЛОЖЬ");
	
	Запрос.УстановитьПараметр("Агент", 		   Агент);
	Запрос.УстановитьПараметр("ДатаНачала",    НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ДобавитьМесяц(Дата, 1)));
	
	ТаблицаЗаданий = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры //ОбновитьТаблицуЗаданий()   

Функция НайтиПодчиненныеМаршруты()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	кпкМаршрут.Ссылка КАК Док
	|ИЗ
	|	Документ.кпкМаршрут КАК кпкМаршрут
	|ГДЕ
	|	кпкМаршрут.ДокОснование = &ДокОснование");
	
	Запрос.УстановитьПараметр("ДокОснование", Ссылка);
	
	МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Док");
	
	Возврат МассивДокументов;
	
КонецФункции // НайтиПодчиненныеМаршруты()

Функция НайтиПодчиненныеЗадания()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	кпкЗадание.Ссылка КАК Док
	|ИЗ
	|	Документ.кпкЗаданиеАгента КАК кпкЗадание
	|ГДЕ
	|	кпкЗадание.ДокОснование = &ДокОснование");
	
	Запрос.УстановитьПараметр("ДокОснование", Ссылка);
	
	МассивДокументов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Док");
	
	Возврат МассивДокументов;
	
КонецФункции // НайтиПодчиненныеЗадания() 

#Если Клиент Тогда
	
// Процедура выводит на печать план посещений агента.
//
Процедура ПечатьПланаПосещений(ФормаПечати, КолДней, ЭтаФорма) Экспорт
	
	Таб = ФормаПечати.ЭлементыФормы.Найти("ТаблицаПланаПосещений");
	Таб.Очистить();
	
	Если ТипПлана = 1 Тогда
		Макет = ЭтотОбъект.ПолучитьМакет("Макет");   
	Иначе
		Макет = ЭтотОбъект.ПолучитьМакет("МакетКлиент");
	КонецЕсли;
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка|ТоргТочка");
	ОбластьШапки.Параметры.Дата = Формат(Дата, "ДЛФ=DD");
	ОбластьШапки.Параметры.Номер = Номер;
	ОбластьШапки.Параметры.Наименование = Агент.Наименование;
	ОбластьШапки.Параметры.Код = Агент.Код;
	Таб.Вывести(ОбластьШапки);
	
	Для пНомер = 1 По КолДней Цикл
		Текст = Вычислить("ЭтаФорма.ЭлементыФормы.Дни.Колонки.Д" + пНомер + ".ТекстШапки");
		СтрДень = Прав(СокрЛП(Текст), 2);
		СтрЧисло = СокрЛП(Лев(Текст, 2));
		Если СтрДень = "ВС" Тогда
			ДопОбластьШапки = Макет.ПолучитьОбласть("Шапка|Воскр");
		ИначеЕсли СтрДень = "СБ" Тогда
			ДопОбластьШапки = Макет.ПолучитьОбласть("Шапка|Субб");
		Иначе
			ДопОбластьШапки = Макет.ПолучитьОбласть("Шапка|День");
		КонецЕсли;
		ДопОбластьШапки.Параметры.ДеньНед = СтрДень;
		ДопОбластьШапки.Параметры.ДеньМес = СтрЧисло;
		Таб.Присоединить(ДопОбластьШапки);
	КонецЦикла;
	
	ВсегоОбластьШапки = Макет.ПолучитьОбласть("Шапка|Всего");
	Таб.Присоединить(ВсегоОбластьШапки);
	
	Зеленый = Новый Цвет(0, 255, 0);
	
	Для Индекс = 0 По Дни.Количество() - 1 Цикл
		Строка = ?(Строка = "Строка", "Строка2", "Строка");
		Стр = Дни.Получить(Индекс);
		Область = Макет.ПолучитьОбласть(Строка + "|ТоргТочка");
		Область.Параметры.Ном = Стр.НомерСтроки;
		
		ТорговаяТочка = Справочники.кпкТорговыеТочки.ПустаяСсылка();	
		Если ТипПлана = 1 Тогда
			Контрагент 	  = Стр.ТорговаяТочка.Владелец;
			ТорговаяТочка = Стр.ТорговаяТочка;
			Область.Параметры.Клиент   = Контрагент;
			Область.Параметры.ПечТочка = ТорговаяТочка;
			Область.Параметры.ТоргТочкаАдрес = Стр.ТорговаяТочка.Адрес;
		Иначе
			Контрагент = Стр.Контрагент;		
			Область.Параметры.Клиент = Контрагент;
			Область.Параметры.ТоргТочкаАдрес = УправлениеКонтактнойИнформацией.ПолучитьАдресИзКонтактнойИнформации(Контрагент, "Фактический");
		КонецЕсли;
		Таб.Вывести(Область);
		
		Смещение = (НачалоДня(Дата) - НачалоМесяца(Дата))/86400 + 1;	
		
		ТекДень =  Дата(Формат(Год(Дата), "ЧГ=0") + Формат(Месяц(Дата), "ЧЦ=2; ЧВН=") + Формат(Смещение, "ЧЦ=2; ЧВН=")); 
		
		Для пНомер = 1 По КолДней Цикл
			Текст    = Вычислить("ЭтаФорма.ЭлементыФормы.Дни.Колонки.Д" + пНомер + ".ТекстШапки");
			Значение = Вычислить("Стр.Д" + пНомер);
			СтрДень  = ВРег(Прав(СокрЛП(Текст), 2));
			
			Если СтрДень = "ВС" Тогда
				ДопОбласть = Макет.ПолучитьОбласть(Строка + "|Воскр");
			ИначеЕсли СтрДень = "СБ" Тогда
				ДопОбласть = Макет.ПолучитьОбласть(Строка + "|Субб");
			Иначе
				ДопОбласть = Макет.ПолучитьОбласть(Строка + "|День");
			КонецЕсли;			
			
			Работа = ?(Значение, "Х", "");
			ДопОбласть.Параметры.ПечРабота = Работа;  			
		 
			СтруктураПараметров = Новый Структура("Контрагент, ТорговаяТочка, День, Работа",
												  Контрагент, ТорговаяТочка, ТекДень, Работа); 
												  
			ДопОбласть.Параметры.СтрПечРабота = СтруктураПараметров;   			
			
			НайденныеСтроки = ТаблицаЗаданий.НайтиСтроки(Новый Структура("Контрагент, ТорговаяТочка, День", 
			Контрагент, ТорговаяТочка, ТекДень));
			
			// Выделяем ячейки с заданием
			Для Каждого НужнаяСтрока Из НайденныеСтроки Цикл 				
				Если пНомер > 0 Тогда 					
					ДопОбласть.ТекущаяОбласть.ЦветФона = Зеленый;
				КонецЕсли;
			КонецЦикла;
			
			Таб.Присоединить(ДопОбласть);
			
			ТекДень = ТекДень + 86400; 
		КонецЦикла;
		
		ВсегоОбласть 					      = Макет.ПолучитьОбласть(Строка + "|Всего");
		ВсегоОбласть.Параметры.ВсегоПосещений = Стр.ВсегоПосещений;
		Таб.Присоединить(ВсегоОбласть);
		
	КонецЦикла;
	
	ОбластьПодвала = Макет.ПолучитьОбласть("Подвал|ТоргТочка");
	ОбластьПодвала.Параметры.КоличествоСтрок = Дни.Количество();
	ОбластьПодвала.Параметры.Автор = Автор;
	Таб.Вывести(ОбластьПодвала);
	
	Для пНомер = 1 По КолДней Цикл
		Итог    = Вычислить("Дни.Итог(""Д" + пНомер + """)");
		Текст   = Вычислить("ЭтаФорма.ЭлементыФормы.Дни.Колонки.Д" + пНомер + ".ТекстШапки");
		СтрДень = ВРег(Прав(СокрЛП(Текст), 2));
		Если СтрДень      = "ВС" Тогда
			ДопОбластьПодвала = Макет.ПолучитьОбласть("Подвал|Воскр");
		ИначеЕсли СтрДень = "СБ" Тогда
			ДопОбластьПодвала = Макет.ПолучитьОбласть("Подвал|Субб");
		Иначе
			ДопОбластьПодвала = Макет.ПолучитьОбласть("Подвал|День");
		КонецЕсли;
		ДопОбластьПодвала.Параметры.ПечИтог = Итог;
		Таб.Присоединить(ДопОбластьПодвала);
	КонецЦикла;
	
	ВсегоОбластьПодвала 				   = Макет.ПолучитьОбласть("Подвал|Всего");
	ВсегоОбластьПодвала.Параметры.ПечВсего = Дни.Итог("ВсегоПосещений");
	Таб.Присоединить(ВсегоОбластьПодвала);
	
	Таб.ТолькоПросмотр 	   = Истина;
	Таб.АвтоМасштаб    	   = Истина;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Таб.ФиксацияСлева 	   = 5;
	Таб.ФиксацияСверху 	   = 7;
	Таб.Показать();
	
	Если НЕ ФормаПечати.Открыта() Тогда
		ФормаПечати.ИспТочек = ТипПлана;
		ФормаПечати.Открыть();
	Иначе
		ФормаПечати.Активизировать();
	КонецЕсли;
	
КонецПроцедуры //Печать()

// Процедура осуществляет печать плана продаж. 
//
Процедура ПечатьПланаПродаж() Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ЭтотОбъект.Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланПосещений.Номер,
	|	ПланПосещений.Дата,
	|	ПланПосещений.ИнтервалПланирования КАК Интервал,
	|	ПланПосещений.Агент,
	|	ПланПосещений.Автор,
	|	ПланПосещений.ПланПродаж.(
	|		НомерСтроки,
	|		НоменклатурнаяГруппа.Наименование КАК Группа,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.кпкПланПосещений КАК ПланПосещений
	|ГДЕ
	|	ПланПосещений.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПланПосещений.ПланПродаж.НомерСтроки";

	Шапка = Запрос.Выполнить().Выбрать();
	Шапка.Следующий();
	ВыборкаТоваров = Шапка.ПланПродаж.Выбрать();
	
	ТабДокумент   = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПланПродаж_ПланПродаж";
	Макет         = ПолучитьМакет("ПланПродаж");

	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = "План продаж №" + Шапка.Номер + " от " + Формат(Шапка.Дата, "ДЛФ=DD");
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	
	КолДней = Шапка.Интервал;
	КолДнейМесяца = (КонецМесяца(Шапка.Дата) - НачалоМесяца(Шапка.Дата) + 1)/86400;
	Если      КолДней = 1 тогда
		ИнтервалСтр = "День";
	ИначеЕсли КолДней = 7 тогда
		ИнтервалСтр = "Неделя";
	ИначеЕсли КолДней = 14  тогда
		ИнтервалСтр = "Две недели";		
	ИначеЕсли КолДней = КолДнейМесяца Тогда
		ИнтервалСтр = "Месяц";
	Иначе		
		ИнтервалСтр = Строка(КолДней) + " дней";				
	КонецЕсли;

	ОбластьМакета.Параметры.Интервал = ИнтервалСтр; 	
	ОбластьМакета.Параметры.Дата = Формат(Шапка.Дата, "ДЛФ=DD"); 	
		
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокТаблицы");	
	ТабДокумент.Вывести(ОбластьМакета);

	ОбластьСтроки = Макет.ПолучитьОбласть("Строка");
	ВыборкаТоваров = Шапка.ПланПродаж.Выбрать();
	Пока ВыборкаТоваров.Следующий() Цикл
		ОбластьСтроки.Параметры.Заполнить(ВыборкаТоваров);		
		ТабДокумент.Вывести(ОбластьСтроки);
	КонецЦикла;

	ОбластьМакета = Макет.ПолучитьОбласть("Итоги");
	ОбластьМакета.Параметры.Заполнить(Шапка);
	Автор = Шапка.Автор;
	ОбластьМакета.Параметры.Автор = "/"+Автор + "/";	
	ОбластьМакета.Параметры.ИтогоСтоимость     = ПланПродаж.Итог("Сумма");
	ТабДокумент.Вывести(ОбластьМакета);
	
	ТабДокумент.ТолькоПросмотр = Истина;
	ТабДокумент.АвтоМасштаб = Истина;	
	ТабДокумент.Показать();          

КонецПроцедуры // ПечатьПланаПродаж()

#КонецЕсли


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Проверяет правильность заполнения строк табличной части "Товары".
//
// Параметры:
// Параметры: 
//  ТаблицаПоТоварам        - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ВыборкаПоШапкеДокумента - выборка из результата запроса по шапке документа,
//  Отказ                   - флаг отказа в проведении.
//  Заголовок               - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеТабличнойЧастиТовары(ТаблицаПоТоварам, Отказ, Заголовок) Экспорт

	// Укажем, что надо проверить:	
	РежимПланирования = Константы.кпкРежимПланированияПродаж.Получить();
	
	Если РежимПланирования = 1 Тогда
		СтруктураОбязательныхПолей = Новый Структура("НоменклатурнаяГруппа, Количество");
	ИначеЕсли РежимПланирования = 2 Тогда
		СтруктураОбязательныхПолей = Новый Структура("НоменклатурнаяГруппа, Сумма");
	Иначе
		СтруктураОбязательныхПолей = Новый Структура("НоменклатурнаяГруппа, Количество, Сумма");
	КонецЕсли;	
	
	// Теперь позовем общую процедуру проверки.
	ЗаполнениеДокументов.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект, "ПланПродаж", СтруктураОбязательныхПолей, Отказ, Заголовок);
    
КонецПроцедуры // ПроверитьЗаполнениеТабличнойЧастиТовары()

// По результату запроса по шапке документа формируем движения по регистрам.
//
// Параметры: 
//  РежимПроведения           - режим проведения документа (оперативный или неоперативный),
//  ВыборкаПоШапкеДокумента   - выборка из результата запроса по шапке документа,
//  ТаблицаПоТоварам          - таблица значений, содержащая данные для проведения и проверки ТЧ Товары
//  ТаблицаПоТаре             - таблица значений, содержащая данные для проведения и проверки ТЧ "Возвратная тара",
//  Отказ                     - флаг отказа в проведении,
//  Заголовок                 - строка, заголовок сообщения об ошибке проведения.
//
Процедура ДвиженияПоРегистрам(РежимПроведения, ТаблицаПоТоварам, Отказ)

	// ПО РЕГИСТРУ ПланыПродаж.
	
	Если ВидОперации <> Перечисления.кпкВидыОперацийПланирования.ПланированиеПосещений Тогда
		
		НаборДвижений = Движения.кпкПланыПродаж;
		
		// Получим таблицу значений, совпадающую со струкутрой набора записей регистра.
		ТаблицаДвижений = НаборДвижений.Выгрузить();
		ТаблицаДвижений.Очистить();
		
		// Заполним таблицу движений.
		ТаблицаТоваров = ТаблицаПоТоварам.Выгрузить();
		
		ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаТоваров, ТаблицаДвижений);
		
		// Недостающие поля.
		ТаблицаДвижений.ЗаполнитьЗначения(Ссылка, "ДокументПланирования");
		ТаблицаДвижений.ЗаполнитьЗначения(Агент,  "Агент");
		
		НаборДвижений.мПериод            = Дата;
		НаборДвижений.мТаблицаДвижений   = ТаблицаДвижений;
		
		Если Не Отказ Тогда
			Движения.кпкПланыПродаж.ДобавитьДвижение();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ДвиженияПоРегистрам()
 

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//  
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(СтруктураШапкиДокумента);
    		
	// Проверить заполнение ТЧ "Товары".
	ПроверитьЗаполнениеТабличнойЧастиТовары(ПланПродаж, Отказ, Заголовок);
	
	// Движения по документу
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(РежимПроведения, ПланПродаж, Отказ);
	КонецЕсли; 

КонецПроцедуры	// ОбработкаПроведения

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		// Произошло изменение пометки на удаление
		
		// Получаем список подчиненных документов маршрутов
		МассивМаршрутов = НайтиПодчиненныеМаршруты();

		Для Каждого ЭлМассива Из МассивМаршрутов Цикл  			
			
			// Нужно установить для документа маршрута пометку удаления
			Маршрут = ЭлМассива.ПолучитьОбъект();
			Маршрут.УстановитьПометкуУдаления(ЭтотОбъект.ПометкаУдаления);
			
			Если ЭтотОбъект.ПометкаУдаления Тогда
				Сообщить("Документ «" + Маршрут + "» помечен на удаление.", СтатусСообщения.Информация);
			Иначе
				Сообщить("У документа «" + Маршрут + "» снята пометка на удаление.",СтатусСообщения.Информация);
			КонецЕсли;
			
		КонецЦикла;	
		
		// Получаем список подчиненных документов заданий
		МассивЗаданий = НайтиПодчиненныеЗадания();

		Для Каждого ЭлМассива Из МассивЗаданий Цикл  			
			
			// Нужно установить для документа маршрута пометку удаления
			Задание = ЭлМассива.ПолучитьОбъект();
			Задание.УстановитьПометкуУдаления(ЭтотОбъект.ПометкаУдаления);
			
			Если ЭтотОбъект.ПометкаУдаления Тогда
				Сообщить("Документ «" + Задание + "» помечен на удаление.", СтатусСообщения.Информация);
			Иначе
				Сообщить("У документа «" + Задание + "» снята пометка на удаление.",СтатусСообщения.Информация);
			КонецЕсли;
			
		КонецЦикла;	

			
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////

ТаблицаЗаданий = Новый ТаблицаЗначений;
ТаблицаЗаданий.Колонки.Добавить("День");
ТаблицаЗаданий.Колонки.Добавить("Контрагент");
ТаблицаЗаданий.Колонки.Добавить("ТорговаяТочка");
ТаблицаЗаданий.Колонки.Добавить("Документ");
